%由于在问题a中，我们得出ode45是比较稳定的方法，因此，在问题b中，我们直接采用ode45求解
%首先我们求解第一个区间，其中为了方便做了一些转置，y1_1指的是y的值，y1_2指的是y的一阶导的值
[t1,y1] = ode45(@vdp1,[0 10],[0.1; -1]);
t1=t1.';
y1_1=(y1(:,1)).';
y1_2=(y1(:,2)).';
n1=length(t1);
%然后求解第二个区间
[t2,y2] = ode45(@vdp2,[10 20],[y1_1(n1); y1_2(n1)]);
t2=t2.';
y2_1=(y2(:,1)).';
y2_2=(y2(:,2)).';
n2=length(t2);
%然后求解第三个区间
[t3,y3] = ode45(@vdp3,[20 30],[y2_1(n2); y2_2(n2)]);
t3=t3.';
y3_1=(y3(:,1)).';
y3_2=(y3(:,2)).';
n3=length(t3);
plot(t1,y1_1,t2,y2_1,t3,y3_1);
%此处的y（1）即为y，y（2）即为y的一阶导
function dydt = vdp1(t1,y)
dydt = [y(2); 
		0.1*(1-y(1)^2)*y(2)-y(1)];%括号不可省，不是变量，y是2x1列向量
end
function dydt = vdp2(t1,y)
dydt = [y(2); 
		1*(1-y(1)^2)*y(2)-y(1)];%括号不可省，不是变量，y是2x1列向量
end
function dydt = vdp3(t1,y)
dydt = [y(2); 
		20*(1-y(1)^2)*y(2)-y(1)];%括号不可省，不是变量，y是2x1列向量
end